Revit 2024 API
RebarShape.Create Method
Overload List
Name | Description
Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32)
 Create a new instance of a Rebar Shape, which defines the shape of a rebar.
Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId)
 Create a new instance of a Rebar Shape, which defines the shape of a rebar.
See Also
RebarShape Class
RebarShape Members
Autodesk.Revit.DB.Structure Namespace